login/scenario.yaml
config:
  target: <target base URL>
  phases:
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Warm up the application"
    - duration: 600
      arrivalRate: 50
      name: "Sustained max load"
  defaults:
    headers:
        brandId: <brand id>
        marketCode: en
        Content-Type: application/json
scenarios:
  - flow:
    - post:
        url: "<URL>"
        json:
          Username: "<username>"
          Password: "<password>"